geIsDir2dOnSurfCoincide3d(OdGeSurface!System.Runtime.CompilerServices.IsConst*,OdGeCurve3d!System.Runtime.CompilerServices.IsConst*,OdGeCurve2d!System.Runtime.CompilerServices.IsConst*,System.Boolean*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeTol!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Determine is direction of 3d curve is the same as direction of curve on surface that can be gotten via 2d parametric curve.
\param pSurf        [in]  Surface.
\param pCurve       [in]  3d curve that lie on pSurf.
\param pParamCurve  [in]  2d parametric curve which corresponds to pCurve on pSurf.
\param isCoincide   [out] Coincide flag.
\param tol          [in]  Geometric tolerance.
\remarks
3d curve should lie on surface with tolerance tol.
Corresponding C++ library: TD_Ge